[
	{
		"autor":"Rodger_van_zant",
		"comment":"This might give a short respite to house buyers but will immediately make renting more difficult. The only solution to the housing crisis in Ireland is more building at a massive scale."
	},
	{
		"autor":"scrjim",
		"comment":"Totally agree. We need projects to build 10k units+ in and around Dublin supported by the government. This waiting for developers to buy up sites in leafy suburbs so they can build expensive BTR schemes is bullshit."
	},
	{
		"autor":"cshevy",
		"comment":"(and in the rest of the cities)"
	},

	{
		"autor":"Willing_Cause_7461",
		"comment":"BTR developments were actually cheaper than average. BTR was a victim of it's own success. Price of rentals was rising significantly faster than purchasable housing so BTR developments became popular. Some people seeing that began freaking out. You can still see it on this subreddit. Things like 'Do you expect people to live in a rental at 90??'. People apparently got it in their head that they would be forced to rent forever so, bye bye BTR."
	},
	
	{
		"autor":"hummph",
		"comment":"BTR is the governments policy so I don’t expect any movement on that while the current government is in office"
	},
	
	{
		"autor":"bertnurney",
		"comment":"Banning airbnb would be a much swifter way to make more properties available and bring rents down"
	},
	
	{
		"autor":"unsureguy2015",
		"comment":"There is nothing really to suggest Airbnb is a massive issue in 2023. According to insideairbnb.com, there is only 781 entire properties on airbnb in Dublin County that are frequently let. If the 781 of those properties were let tomorrow, it is not going to move the needle in anyway."
	},
	{
		"autor":"bertnurney",
		"comment":"Insideairbnb shows 3786 entire home/properties for Dublin. That's 3786 properties that could be on the long term rental market. Ban airbnb and they will either sell or put it up to rent long term"
	},
	
	{
		"autor":"unsureguy2015",
		"comment":"If you go back on site and select 'Only recent and frequently booked. Activity', you will see the number of entire airbnbs in Dublin is only 781 properties. If you let your apartment on Airbnb for a weekend 2 years ago and never let it since, it is one of those 3,786 properties on airbnb. However, it is not actually on airbnb for let now and should not be included in the stats."
	},
	{
		"autor":"bertnurney",
		"comment":"Any idea how recent it means? If we could filter by recent but not necessarily frequent that would be an improvement"
	},	
	{
		"autor":"unsureguy2015",
		"comment":"It seems that if the property is let more than 90 days in a yet, it is 'Only recent and frequently booked Activity'. If we could filter by recent but not necessarily frequent that would be an improvement. Why is that an improvement? You need 'recent and frequently booked' to quantify the impact on the housing market. If I let my apartment on Airbnb this week and never let it again. Sure it was recently booked on airbnb, but you can't say it is constantly being booked and therefore taking a home off the market. This insideairbnb.com reasoning for that filter: Is the home, apartment or room rented frequently and displacing units of housing and residents? Does the income from Airbnb incentivise short-term rentals vs long-term housing?"
	},
	{
		"autor":"bertnurney",
		"comment":"OK you think that number is good to go on. I don't. Try airdna instead. They have a filter for properties that have been either available or listed one day over the past month. These are entire properties that would otherwise be on the long term rental market. The number is 2765 for Dublin: https://ibb.co/mRB5Vg6"
	},
	{
		"autor":"hurpyderp",
		"comment":"Have your factored in people who will rent their house out on Airbnb when they go on holidays or people who rent it out on Airbnb for a week or two and move to their parents house?"
	},
	{
		"autor":"bertnurney",
		"comment":"Surely a very small percentage. I'll contact airdna to try and get more info. Ill request properties that have been available for more than 90 days a year and more than 30 days a year."
	},
	{
		"autor":"unsureguy2015",
		"comment":"OK you think that number is good to go on. I don't. Of course you don't. You are grasping at straws to back up a claim that you can't actually prove... The number is 2765 for Dublin: https://ibb.co/mRB5Vg6. Did you even read what you posted? Their number for entire properties is 1.5k... I had a look at airdna myself, as I have never been on it before. As you said they have the filter 'for properties that have been either available or listed one day over the past month'. The number of entire properties in Dublin with that filter is 768. Funnily that number pretty much matches insideairbnb... It is interesting that 68% of properties on airdna have AC. Simple question with a yes or no answer. Do irish homes usually have AC? The answer is no. So it seems a lot of airbnbs listed on airbnb might actually be purpose built short term lets that are allowed under the law. None of the above probably makes a different to you, as you just going to lie about the number of airbnb's in Dublin anyway..."
	},
	{
		"autor":"bertnurney",
		"comment":"OK I misread the graph, but its still 1500 properties, where are you getting 768?"
	},
	{
		"autor":"bertnurney",
		"comment":"Where are you getting the 768 number from airdna? It's 1500"
	},
	
	{
		"autor":"bertnurney",
		"comment":"Industrial level of property letting from these 'top hosts'. Banning airbnb would have a huge effect. https://ibb.co/WPZP5FS"
	},
	
	{
		"autor":"unsureguy2015",
		"comment":"Industrial level of property letting from these 'top hosts'. Some of those top hosts have properties that have planning permission for short term lets. Sure you can ban them off airbnb, but they will just be on booking.com etc. Banning airbnb would have a huge effect. There is no data to back up that claim. As I have pointed out, the number of entire properties really being let on Airbnb is 781. Some of those have planning permission to be short term lets, so the number of illegal airbnb's is smaller."
	},
	
	{
		"autor":"bertnurney",
		"comment":"OK, if we take the 781 figure that's still more than what's on Daft for Dublin. So that would have an impact."
	},
	
	{
		"autor":"unsureguy2015",
		"comment":"What is on daft is a snapshot today. Over a month there will be thousands of lettings advertised and removed, as the properties are let. So that would have an impact. It will have an impact. A meaningful impact to write home about, well seriously doubt it when you consider 1.45m people live in Dublin county"
	},
	
	{
		"autor":"bertnurney",
		"comment":"How about 2700 properties? Airdna shows entire places that have either been rented or available to rent at least one day in the past month. As far as I am concerned they are properties that could be rented on daft https://ibb.co/mRB5Vg6"
	},
	
	{
		"autor":"unsureguy2015",
		"comment":"Commenting below on what I just posted on the other comment: Did you even read what you posted? Their number for entire properties is 1.5k... I had a look at airdna myself, as I have never been on it before. As you said they have the filter 'for properties that have been either available or listed one day over the past month'. The number of entire properties in Dublin with that filter is 768. Funnily that number pretty much matches insideairbnb... It is interesting that 68% of properties on airdna have AC. Simple question with a yes or no answer. Do irish homes usually have AC? The answer is no. So it seems a lot of airbnbs listed on airbnb might actually be purpose built short term lets that are allowed under the law. None of the above probably makes a different to you, as you just going to lie about the number of airbnb's in Dublin anyway..."
	},
	
	{
		"autor":"Equivalent-Career-49",
		"comment":"While a small number overall, 500-700 new properties on the market in Dublin would be better than nothing, a step in the right direction."
	},
	
	{
		"autor":"dashoonage",
		"comment":"or make it more attractive to rent a property out than to airbnb it."
	},
	
	{
		"autor":"bertnurney",
		"comment":"Yeah but we are in desperate times so I think we need desperate measures. More stick than carrot"
	},
	
	{
		"autor":"Bipitybopityboo27",
		"comment":"The problem is that constantly using the stick approach towards landlords is having the exact undesirable effect this article is highlighting!"
	},
	
	{
		"autor":"Equivalent-Career-49",
		"comment":"A lot of small landlords are selling because they bought property which went into negative equity. They then rented out the property until prices recovered enough to bring them out of negative equity which is happening. There are also a lot of people speculating prices will fall with increased interest rates so a lot of people are taking this chance to sell their non-resident properties. Some is 'stick related' for sure but most is people who were caught out in the crash now selling up as prices have recovered (in many areas)."
	},
	
	{
		"autor":"temujin64",
		"comment":"Gaillimh. Not really. It's already banned in rent control areas if you don't live in the property. I'd imagine that most people that put up a room on AirBnB because it's convenient to have their tenant leave after a few days. I'd imagine that the vast majority of people would simply stop renting out a room if they didn't have AirBnB. That would lead to a higher demand for hotel spaces which would compete with housing construction. So it might actually make the problem worse."
	},
	
	{
		"autor":"slamjam25",
		"comment":"Indeed the research from other AirBnB bans clearly shows that you’re correct."
	},
	
	{
		"autor":"Equivalent-Career-49",
		"comment":"Banned in theory but not in reality, terrible enforcement."
	},
	
	{
		"autor":"bertnurney",
		"comment":"Banned in rent control areas if you dont live in the property? So there should be no full property listings at all for Dublin then? It's not renting a room thats the problem, it's the listings that advertise a whole property. If the owner can't list on airbnb, they will have 2 choices: rent it long term or sell it. Option 1 will add to rental supply and help reduce rents Option 2 will mean it's either sold to a new landlord or possibly to an owner occupier, neither has a negative impact on the housing situation"
	},
	
	{
		"autor":"temujin64",
		"comment":"Gaillimh. Fair enough, but you're just advocating for enforcement of the existing law, not an outright ban as you said earlier."
	},
	
	{
		"autor":"bertnurney",
		"comment":"The problem is the laws are not enforced. They brought in a law a few years ago that you had to declare airbnb income with revenue. 7 people registered. That law was just the govt being seen to do something without doing anything. The latest law requiring them to be registered with bord failte looks like it may work on paper but will it be enforced?"
	},
	
	{
		"autor":"temujin64",
		"comment":"Gaillimh. It's generally an issue with a lot of our laws. An Austrian friend of mine who lives here said that the biggest frustration is that many laws and rules are totally unenforced."
	},
	
	{
		"autor":"unsureguy2015",
		"comment":"They brought in a law a few years ago that you had to declare airbnb income with revenue. 7 people registered. Source for that claim? Do you realise that Airbnb are required to get tax details from every host in Ireland? Do you realise that Revenue regularly receive data from airbnb on the earnings of each host in the country. It is comical that people like you think Government would turn a blind eye to the tax collection on a site that is based in Ireland that you can easily audit people earnings from. Do you really think only 7 hosts on airbnb are actually paying tax?"
	},
	
	{
		"autor":"bertnurney",
		"comment":"7 was an exaggeration, it was actually 110 owners who registered. It was a govt requirement to register for planning if you rented a property for more than 90 days. https://www.irishtimes.com/news/ireland/irish-news/only-a-fraction-of-airbnb-landlords-register-under-new-letting-rules-1.3969974. My point stands, people just ignore these regulations."
	},
	
	{
		"autor":"unsureguy2015",
		"comment":"7 was an exaggeration, it was actually 110 owners who registered. Don't worry, I am getting used to you exaggerating/making up points at this stage... That article does not mention anything about declaring income to revenue? It is about DCC saying people did not register Airbnbs with them. Do you know DCC is not Revenue? My point stands, people just ignore these regulations. Eh, you can have an opinion. But when you claim people are not declaring income with revenue and cite an article referring to DCC saying people have not registered their airbnb from a planning POV. Your point has no legs... As I have pointed out, Airbnb requires a tax number from each host and shares it with Revenue."
	},
	
	{
		"autor":"bertnurney",
		"comment":"You're putting a lot of time into defending airbnb? Full disclosure, do you use it by any chance? Or work for them?"
	},
	
	{
		"autor":"GaMa-Binkie",
		"comment":"The only solution to the housing crisis in Ireland is more building at a massive scale. What about killing all the poor? Type that into the computer and see if it works"
	},
	
	{
		"autor":"Full-Pack9330",
		"comment":"Yes, put it in; we won't know until we try..."
	},
	
	{
		"autor":"Leavser1",
		"comment":"Reposted as 'I made a right balls of that' 😂😂😂"
	},
	
	{
		"autor":"Bill_Badbody",
		"comment":"I'm just here to point out people's errors 😅"
	},
	
	{
		"autor":"Leavser1",
		"comment":"Thanks 😂😂. Only saving grace is most people missed it as they're still asleep 🤣"
	},
	
	{
		"autor":"badger-biscuits",
		"comment":"Bill Badbody never sleeps. It's a full time job being a leader of the Irish Landlord League."
	},
	
	{
		"autor":"Bill_Badbody",
		"comment":"Sleep is for the poor."
	},
	
	{
		"autor":"badger-biscuits",
		"comment":"Never change Bill!"
	},
	
	{
		"autor":"justbrowsinginpeace",
		"comment":"There is 106 properties of all types for sale in D13. There is 1 to rent."
	},
	
	{
		"autor":"J-zus",
		"comment":"only 2% rise on obscenely overpriced is still obscenely overpriced"
	},
	
	{
		"autor":"Fr_DougalMc",
		"comment":"We need to follow Canada and stop institutional purchasing of properties. That would have a real impact."
	},
	
	{
		"autor":"Leavser1",
		"comment":"Would that not take more rentals out of the market? A quick look shows that (albeit expensive) there is a lot of property for sale. There is very little to none available for rent"
	},
	
	{
		"autor":"Fr_DougalMc",
		"comment":"Institutional landlords are generally very good to rent from. The problem isn't ownership, the problem - and I'm not saying anything we don't know here - is supply."
	},
	
	{
		"autor":"adjavang",
		"comment":"Mixed feelings about this, I'm not a fan of how fucked up the rental market is and most of the landlords I've had the displeasure of interacting with have been unmitigated arseholes only interested in money. That said, this will only make things worse and it's a symptom of a much larger issue with our housing market."
	},
	
	{
		"autor":"stryptos",
		"comment":"We should regulate our own assholes instead of selling the place out to multinational corporate assholes"
	},
	
	{
		"autor":"Churt_Lyne",
		"comment":"They have to abide by the same regulations. And, as mentioned above, they are generally very good to rent from."
	},
	
	{
		"autor":"Dazzler92",
		"comment":"We're starting to see the consequences of the policies of rent capping and eviction bans imo"
	},
	
	{
		"autor":"Worth_Persimmon_9561",
		"comment":"Exactly!"
	},
	
	{
		"autor":"InternetCrank",
		"comment":"As the article says, small landlords are exiting the market due to restrictive and unpredictable regulations - there's a (very justifiable) fear that if SF get voted in next time they'll stick it to landlords in some petty way in order to pander to their base of pissed off young people who haven't got on the property ladder yet and view home owners as the enemy. As an example - I own an apartment, and had moved out of it for the past few years to a more convenient spot for work and rented it for the duration. I had recently moved again when my new landlord needed the property back as they had a change in family circumstances that meant they needed to move back in. I got the legally required amount of notice on the place I had recently moved into, however I had to give my tenant much more notice and was effectively left homeless for a few months. And I was lucky that the eviction notice came when it did, as a few weeks later and I'd have been caught by yet another change in the law making me unable to move back into my own property at all for the best part of a year. If you only own one or two places and like the flexibility to be able to use it at all, ever, in future, then there's a great risk that SF will take that flexibility away. People don't see the value in owning the property any more so are selling."
	},
	
	{
		"autor":"Leavser1",
		"comment":"Builders are putting off building because prices aren't increasing to match the rising costs. It's a catch 22."
	},
	
	{
		"autor":"Bob_Odinson",
		"comment":"Maybe so, but the issue is people who become property owners quickly forget they once rented (not all, but many did), and it's not in their interest to have that change."
	},
	
	{
		"autor":"[deleted]",
		"comment":"True, but it shouldn’t be up to them."
	},
	
	{
		"autor":"Churt_Lyne",
		"comment":"It's not really in your interests as an owner either if prices keep increasing, as your next (better) house is getting more expensive. The only exception is those who may get caught in negative equity for a short time, and that's a price I think society should be prepared to pay."
	},
	
	{
		"autor":"arseface1",
		"comment":"Investors sell at the top of the market"
	},
	
	{
		"autor":"Dev__",
		"comment":"Exodus of Landlords: Where do they go? -- like if you sell a house some other chap bought it and he's now he's in a position to be a landlord or it has satisfied some demand for housing as he'll use it himself. Am I wrong for thinking there is no story here or just missing something?"
	},
	
	{
		"autor":"unsureguy2015",
		"comment":"he's now he's in a position to be a landlord. Why would anyone want to be a landlord? All the estate agents will tell you that a majority of homes being sold and not being bought by rents. The amount of rental stock is getting smaller year by year. or it has satisfied some demand for housing as he'll use it himself. What about students? What about low income people? What about people moving here for a few years? None of them can/are able to buy a property. We need rental properties for a sizeable amount of the population."
	},
	
	{
		"autor":"Bmccabe215",
		"comment":"Impossible property prices cant fall. We have low supply."
	},
	
	{
		"autor":"[deleted]",
		"comment":"Another boring property price post"
	},
	
	{
		"autor":"AquaSeafoamSpray",
		"comment":"I have a hunch my LL is gonna sell up. Its a large premises on street in affluentish area, three apartment block developments around. The thoughts of finding a place again in this market fills me with dread."
	},
	
	{
		"autor":"manfredmahon",
		"comment":"Just got an email from the landlord this morning that they're selling. Very few places around"
	},
	
	{
		"autor":"gadarnol",
		"comment":"If you know the history of the country you will know that landlordism on a large scale is always a recipe for disaster and social unrest."
	}


]